integration/src/InformationRegisters/грОчередьВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>грОчередьВходящихСообщений</Name>
			<Comment>Очередь входящих сообщений</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сшпФорматыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.грСистемыИнтеграционногоКонтура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.грВходящиеВнутренниеОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

integration/src/Enums/сшпСтатусыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>сшпСтатусыСообщений</Name>
			<Comment>Основные статусы сообщений</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВалидно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаОтменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаОтменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаПодтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствуетОбработчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПакетнаяОбработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

integration/src/InformationRegisters/грОчередьВходящихСообщений/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура БыстрыйПоиск(Команда)
	КлючЗаписи = ПолучитьКлючЗаписиПоСтрокеПоиска(СтрокаБыстрогоПоиска);
	Если ТипЗнч(КлючЗаписи) = Тип("Строка") Тогда 
		ПоказатьОповещениеПользователя(КлючЗаписи);
	Иначе
		Элементы.Список.ТекущаяСтрока = КлючЗаписи;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВернутьВОбработку(Команда)
	
	ВернутьВОбработкуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОбработку(Команда)
	
	ОтменитьОбработкуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Вернуть в обработку на сервере
//
Процедура ВернутьВОбработкуНаСервере()
	
	Для Каждого ключЗаписи Из Элементы.Список.ВыделенныеСтроки Цикл 
		
		грОбработкаПакетовИнтеграции.УстановитьСостояниеСообщения(ключЗаписи.ИдентификаторСообщения, Перечисления.сшпСтатусыСообщений.ОжиданиеОбработки); 
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
// Процедура - Отменить обработку на сервере
//
Процедура ОтменитьОбработкуНаСервере()
	
	Для Каждого ключЗаписи Из Элементы.Список.ВыделенныеСтроки Цикл 
		
		грОбработкаПакетовИнтеграции.УстановитьСостояниеСообщения(ключЗаписи.ИдентификаторСообщения, Перечисления.сшпСтатусыСообщений.ОбработкаОтменена); 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция - ПолучитьКлючЗаписиПоСтрокеПоиска
// 
// Возвращаемое значение:
// КлючЗаписи, Строка - ключ записи - если запись найдена, строка - текст ошибки.
//
Функция ПолучитьКлючЗаписиПоСтрокеПоиска(СтрокаПоиска) Экспорт 
	
	Попытка
		
		ИдентификаторСообщения = Новый УникальныйИдентификатор(СтрокаПоиска);
	
	Исключение
		
		Возврат "Для поиска требуется ввести в строке уникальный идентификатор сообщения полностью";
	
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	грОчередьВходящихСообщений.ИдентификаторСообщения
		|ИЗ
		|	РегистрСведений.грОчередьВходящихСообщений КАК грОчередьВходящихСообщений
		|ГДЕ
		|	грОчередьВходящихСообщений.ИдентификаторСообщения = &ИдентификаторСообщения";	
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		 
		Возврат "Сообщение не найдено";
		
	Иначе
		
		Возврат РегистрыСведений.грОчередьВходящихСообщений.СоздатьКлючЗаписи(Новый Структура("ИдентификаторСообщения", ИдентификаторСообщения));
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
